<?php

return [

    /*
     |--------------------------------------------------------------------------
     | Список городов
     |--------------------------------------------------------------------------
     |
     |
     */
    'cities' => [
        [
            'id' => 'msk',
            'name' => 'Москва',
        ],
        [
            'id' => 'piter',
            'name' => 'Санкт-Петербург',
        ],
        [
            'id' => 'kzn',
            'name' => 'Казань',
        ],
        [
            'id' => 'ekb',
            'name' => 'Екатеринбург',
        ],
    ],

    'pluck_cities' => [
        'msk' => 'Москва',
        'piter' => 'Санкт-Петербург',
        'spb' => 'Санкт-Петербург',
        'kzn' => 'Казань',
        'ekb' => 'Екатеринбург',
    ]

];
